Enums/ТипыТестовыхВопросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыТестовыхВопросов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МногиеИзМногих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинИзМногих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Последовательность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Соответствие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открытый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинИзМногихНаКартинке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводСКлавиатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыТестовыхВопросов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ЭлектронноеОбучениеСлужебный.ИсключитьЗначенияПеречисленияИзСпискаВыбора(Параметры, ДанныеВыбора, "ТипыТестовыхВопросов", СтандартнаяОбработка);	

КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ТипВопросаВСтроку(ТипВопроса) Экспорт
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.ОдинИзМногих Тогда
		Возврат "SINGLE";
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.ОдинИзМногихНаКартинке Тогда
		Возврат "SINGLE";
	КонецЕсли;	
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.МногиеИзМногих Тогда
		Возврат "MULTIPLE";
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.Последовательность Тогда
		Возврат "SEQUENCE";
	КонецЕсли;	
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.ВводСКлавиатуры Тогда
		Возврат "INPUT";
	КонецЕсли;		
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.Соответствие Тогда
		Возврат "MAP";
	КонецЕсли;		
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.Открытый Тогда
		Возврат "TEXT";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ВсеТипы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипыТестовыхВопросов.Ссылка КАК Ссылка
		|ИЗ
		|	Перечисление.ТипыТестовыхВопросов КАК ТипыТестовыхВопросов";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#КонецЕсли
